package main

//===========================================================
//Задача 1
//Составьте правильный запрос, который выдает страну и количество студентов из таблицы students, где количество студентов больше 10 и они (студенты) не из Китая(China). Таблица students (id, name, country)
//===========================================================
//
//===========================================================
//Задача 2
//Будет ошибка что все горутины заблокированы. Какие горутины будут заблокированы? И почему?
//===========================================================

//package main
//import "fmt"
//
//func main() {
//	//ch := make(chan int) // не буф.канал
//	ch := make(chan int, 1) // 2. или добавить буфер
//	//ch <- 1 //main заблокирована, ожидает получателя
//	go func() {
//		fmt.Println(<-ch) // горутина не запустится-main заблокирована, не дошла до её создания
//	}()
//	//ch <- 1 // 1.запустить получателя до отправки в канал
//}

//===========================================================
//Задача 3
//1. ЫЫЫхыхы (Было именно так, а имелось ввиду "Что выведется?")
//===========================================================
//package main
import "fmt"

func main() {
	c := []string{"A", "B", "D", "E"}
	b := c[1:2] // "B"
	b = append(b, "TT")
	fmt.Println(c) // "A", "B", "D", "E" : хуй -будет [A B TT E]: c и b ссылаются на один и тот же базовый массив
	/* b имеет:Длину: 1 (элемент с индексом 1 - "B")
	Емкость: 3 (потому что в исходном массиве после "B" есть еще 2 элемента: "D" и "E")
	Поскольку у b есть свободная емкость (2 свободных места), append добавит "TT" в тот же базовый массив
	Это заменит следующий элемент в исходном массиве:
	Было: ["A", "B", "D", "E"]
	Стало: ["A", "B", "TT", "E"]*/
	fmt.Println(b) // "B", "TT"
}

//
//===========================================================
//Задача 4
//1. Что выведется?
//===========================================================
//package main
//
//import (
//"fmt"
//"math"
//)
//
//func main() {
//	x := 2.0
//	y := 3.0
//
//	result := math.Pow(x, y)
//
//	fmt.Println("%f ^ %f = %f\n", x, y, result)
//}
