package main

import "fmt"

// ------------------------------------------------------------------------------------------------------------
// Задача 1
// 1. Что выведет код?
// ------------------------------------------------------------------------------------------------------------
func main() {
	var foo []int
	var bar []int

	foo = append(foo, 1)
	foo = append(foo, 2)
	foo = append(foo, 3)
	bar = append(foo, 4)
	foo = append(foo, 5)

	fmt.Println(foo, bar) // [1 2 3 5] [1 2 3 5]
}

// вне функции; foo и bar ссылаются на один базовый массив
